ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CONTROLSS_INTXBAR_CONTROLSS_502D5000h.xml
<module name="CONTROLSS" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_INTXBAR0_G0" acronym="CONTROLSS_INTXBAR0_G0" offset="256" width="32" description="INT XBAR 0 Input Select.">
		<bitfield id="INTXBAR0_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR0_G1" acronym="CONTROLSS_INTXBAR0_G1" offset="260" width="32" description="INT XBAR 0 Input Select.">
		<bitfield id="INTXBAR0_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR0_G2" acronym="CONTROLSS_INTXBAR0_G2" offset="264" width="32" description="INT XBAR 0 Input Select.">
		<bitfield id="INTXBAR0_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR0_G3" acronym="CONTROLSS_INTXBAR0_G3" offset="268" width="32" description="INT XBAR 0 Input Select.">
		<bitfield id="INTXBAR0_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR0_G4" acronym="CONTROLSS_INTXBAR0_G4" offset="272" width="32" description="INT XBAR 0 Input Select.">
		<bitfield id="INTXBAR0_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR0_G5" acronym="CONTROLSS_INTXBAR0_G5" offset="276" width="32" description="INT XBAR 0 Input Select.">
		<bitfield id="INTXBAR0_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR0_G6" acronym="CONTROLSS_INTXBAR0_G6" offset="280" width="32" description="INT XBAR 0 Input Select.">
		<bitfield id="INTXBAR0_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR1_G0" acronym="CONTROLSS_INTXBAR1_G0" offset="320" width="32" description="INT XBAR 1 Input Select.">
		<bitfield id="INTXBAR1_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR1_G1" acronym="CONTROLSS_INTXBAR1_G1" offset="324" width="32" description="INT XBAR 1 Input Select.">
		<bitfield id="INTXBAR1_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR1_G2" acronym="CONTROLSS_INTXBAR1_G2" offset="328" width="32" description="INT XBAR 1 Input Select.">
		<bitfield id="INTXBAR1_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR1_G3" acronym="CONTROLSS_INTXBAR1_G3" offset="332" width="32" description="INT XBAR 1 Input Select.">
		<bitfield id="INTXBAR1_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR1_G4" acronym="CONTROLSS_INTXBAR1_G4" offset="336" width="32" description="INT XBAR 1 Input Select.">
		<bitfield id="INTXBAR1_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR1_G5" acronym="CONTROLSS_INTXBAR1_G5" offset="340" width="32" description="INT XBAR 1 Input Select.">
		<bitfield id="INTXBAR1_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR1_G6" acronym="CONTROLSS_INTXBAR1_G6" offset="344" width="32" description="INT XBAR 1 Input Select.">
		<bitfield id="INTXBAR1_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR2_G0" acronym="CONTROLSS_INTXBAR2_G0" offset="384" width="32" description="INT XBAR 2 Input Select.">
		<bitfield id="INTXBAR2_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR2_G1" acronym="CONTROLSS_INTXBAR2_G1" offset="388" width="32" description="INT XBAR 2 Input Select.">
		<bitfield id="INTXBAR2_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR2_G2" acronym="CONTROLSS_INTXBAR2_G2" offset="392" width="32" description="INT XBAR 2 Input Select.">
		<bitfield id="INTXBAR2_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR2_G3" acronym="CONTROLSS_INTXBAR2_G3" offset="396" width="32" description="INT XBAR 2 Input Select.">
		<bitfield id="INTXBAR2_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR2_G4" acronym="CONTROLSS_INTXBAR2_G4" offset="400" width="32" description="INT XBAR 2 Input Select.">
		<bitfield id="INTXBAR2_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR2_G5" acronym="CONTROLSS_INTXBAR2_G5" offset="404" width="32" description="INT XBAR 2 Input Select.">
		<bitfield id="INTXBAR2_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR2_G6" acronym="CONTROLSS_INTXBAR2_G6" offset="408" width="32" description="INT XBAR 2 Input Select.">
		<bitfield id="INTXBAR2_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR3_G0" acronym="CONTROLSS_INTXBAR3_G0" offset="448" width="32" description="INT XBAR 3 Input Select.">
		<bitfield id="INTXBAR3_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR3_G1" acronym="CONTROLSS_INTXBAR3_G1" offset="452" width="32" description="INT XBAR 3 Input Select.">
		<bitfield id="INTXBAR3_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR3_G2" acronym="CONTROLSS_INTXBAR3_G2" offset="456" width="32" description="INT XBAR 3 Input Select.">
		<bitfield id="INTXBAR3_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR3_G3" acronym="CONTROLSS_INTXBAR3_G3" offset="460" width="32" description="INT XBAR 3 Input Select.">
		<bitfield id="INTXBAR3_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR3_G4" acronym="CONTROLSS_INTXBAR3_G4" offset="464" width="32" description="INT XBAR 3 Input Select.">
		<bitfield id="INTXBAR3_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR3_G5" acronym="CONTROLSS_INTXBAR3_G5" offset="468" width="32" description="INT XBAR 3 Input Select.">
		<bitfield id="INTXBAR3_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR3_G6" acronym="CONTROLSS_INTXBAR3_G6" offset="472" width="32" description="INT XBAR 3 Input Select.">
		<bitfield id="INTXBAR3_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR4_G0" acronym="CONTROLSS_INTXBAR4_G0" offset="512" width="32" description="INT XBAR 4 Input Select.">
		<bitfield id="INTXBAR4_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR4_G1" acronym="CONTROLSS_INTXBAR4_G1" offset="516" width="32" description="INT XBAR 4 Input Select.">
		<bitfield id="INTXBAR4_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR4_G2" acronym="CONTROLSS_INTXBAR4_G2" offset="520" width="32" description="INT XBAR 4 Input Select.">
		<bitfield id="INTXBAR4_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR4_G3" acronym="CONTROLSS_INTXBAR4_G3" offset="524" width="32" description="INT XBAR 4 Input Select.">
		<bitfield id="INTXBAR4_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR4_G4" acronym="CONTROLSS_INTXBAR4_G4" offset="528" width="32" description="INT XBAR 4 Input Select.">
		<bitfield id="INTXBAR4_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR4_G5" acronym="CONTROLSS_INTXBAR4_G5" offset="532" width="32" description="INT XBAR 4 Input Select.">
		<bitfield id="INTXBAR4_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR4_G6" acronym="CONTROLSS_INTXBAR4_G6" offset="536" width="32" description="INT XBAR 4 Input Select.">
		<bitfield id="INTXBAR4_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR5_G0" acronym="CONTROLSS_INTXBAR5_G0" offset="576" width="32" description="INT XBAR 5 Input Select.">
		<bitfield id="INTXBAR5_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR5_G1" acronym="CONTROLSS_INTXBAR5_G1" offset="580" width="32" description="INT XBAR 5 Input Select.">
		<bitfield id="INTXBAR5_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR5_G2" acronym="CONTROLSS_INTXBAR5_G2" offset="584" width="32" description="INT XBAR 5 Input Select.">
		<bitfield id="INTXBAR5_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR5_G3" acronym="CONTROLSS_INTXBAR5_G3" offset="588" width="32" description="INT XBAR 5 Input Select.">
		<bitfield id="INTXBAR5_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR5_G4" acronym="CONTROLSS_INTXBAR5_G4" offset="592" width="32" description="INT XBAR 5 Input Select.">
		<bitfield id="INTXBAR5_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR5_G5" acronym="CONTROLSS_INTXBAR5_G5" offset="596" width="32" description="INT XBAR 5 Input Select.">
		<bitfield id="INTXBAR5_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR5_G6" acronym="CONTROLSS_INTXBAR5_G6" offset="600" width="32" description="INT XBAR 5 Input Select.">
		<bitfield id="INTXBAR5_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR6_G0" acronym="CONTROLSS_INTXBAR6_G0" offset="640" width="32" description="INT XBAR 6 Input Select.">
		<bitfield id="INTXBAR6_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR6_G1" acronym="CONTROLSS_INTXBAR6_G1" offset="644" width="32" description="INT XBAR 6 Input Select.">
		<bitfield id="INTXBAR6_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR6_G2" acronym="CONTROLSS_INTXBAR6_G2" offset="648" width="32" description="INT XBAR 6 Input Select.">
		<bitfield id="INTXBAR6_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR6_G3" acronym="CONTROLSS_INTXBAR6_G3" offset="652" width="32" description="INT XBAR 6 Input Select.">
		<bitfield id="INTXBAR6_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR6_G4" acronym="CONTROLSS_INTXBAR6_G4" offset="656" width="32" description="INT XBAR 6 Input Select.">
		<bitfield id="INTXBAR6_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR6_G5" acronym="CONTROLSS_INTXBAR6_G5" offset="660" width="32" description="INT XBAR 6 Input Select.">
		<bitfield id="INTXBAR6_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR6_G6" acronym="CONTROLSS_INTXBAR6_G6" offset="664" width="32" description="INT XBAR 6 Input Select.">
		<bitfield id="INTXBAR6_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR7_G0" acronym="CONTROLSS_INTXBAR7_G0" offset="704" width="32" description="INT XBAR 7 Input Select.">
		<bitfield id="INTXBAR7_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR7_G1" acronym="CONTROLSS_INTXBAR7_G1" offset="708" width="32" description="INT XBAR 7 Input Select.">
		<bitfield id="INTXBAR7_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR7_G2" acronym="CONTROLSS_INTXBAR7_G2" offset="712" width="32" description="INT XBAR 7 Input Select.">
		<bitfield id="INTXBAR7_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR7_G3" acronym="CONTROLSS_INTXBAR7_G3" offset="716" width="32" description="INT XBAR 7 Input Select.">
		<bitfield id="INTXBAR7_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR7_G4" acronym="CONTROLSS_INTXBAR7_G4" offset="720" width="32" description="INT XBAR 7 Input Select.">
		<bitfield id="INTXBAR7_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR7_G5" acronym="CONTROLSS_INTXBAR7_G5" offset="724" width="32" description="INT XBAR 7 Input Select.">
