ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CONTROLSS_INTXBAR_CONTROLSS_502D5000h.xml
		<bitfield id="INTXBAR7_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR7_G6" acronym="CONTROLSS_INTXBAR7_G6" offset="728" width="32" description="INT XBAR 7 Input Select.">
		<bitfield id="INTXBAR7_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR8_G0" acronym="CONTROLSS_INTXBAR8_G0" offset="768" width="32" description="INT XBAR 8 Input Select.">
		<bitfield id="INTXBAR8_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR8_G1" acronym="CONTROLSS_INTXBAR8_G1" offset="772" width="32" description="INT XBAR 8 Input Select.">
		<bitfield id="INTXBAR8_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR8_G2" acronym="CONTROLSS_INTXBAR8_G2" offset="776" width="32" description="INT XBAR 8 Input Select.">
		<bitfield id="INTXBAR8_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR8_G3" acronym="CONTROLSS_INTXBAR8_G3" offset="780" width="32" description="INT XBAR 8 Input Select.">
		<bitfield id="INTXBAR8_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR8_G4" acronym="CONTROLSS_INTXBAR8_G4" offset="784" width="32" description="INT XBAR 8 Input Select.">
		<bitfield id="INTXBAR8_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR8_G5" acronym="CONTROLSS_INTXBAR8_G5" offset="788" width="32" description="INT XBAR 8 Input Select.">
		<bitfield id="INTXBAR8_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR8_G6" acronym="CONTROLSS_INTXBAR8_G6" offset="792" width="32" description="INT XBAR 8 Input Select.">
		<bitfield id="INTXBAR8_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR9_G0" acronym="CONTROLSS_INTXBAR9_G0" offset="832" width="32" description="INT XBAR 9 Input Select.">
		<bitfield id="INTXBAR9_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR9_G1" acronym="CONTROLSS_INTXBAR9_G1" offset="836" width="32" description="INT XBAR 9 Input Select.">
		<bitfield id="INTXBAR9_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR9_G2" acronym="CONTROLSS_INTXBAR9_G2" offset="840" width="32" description="INT XBAR 9 Input Select.">
		<bitfield id="INTXBAR9_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR9_G3" acronym="CONTROLSS_INTXBAR9_G3" offset="844" width="32" description="INT XBAR 9 Input Select.">
		<bitfield id="INTXBAR9_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR9_G4" acronym="CONTROLSS_INTXBAR9_G4" offset="848" width="32" description="INT XBAR 9 Input Select.">
		<bitfield id="INTXBAR9_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR9_G5" acronym="CONTROLSS_INTXBAR9_G5" offset="852" width="32" description="INT XBAR 9 Input Select.">
		<bitfield id="INTXBAR9_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR9_G6" acronym="CONTROLSS_INTXBAR9_G6" offset="856" width="32" description="INT XBAR 9 Input Select.">
		<bitfield id="INTXBAR9_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR10_G0" acronym="CONTROLSS_INTXBAR10_G0" offset="896" width="32" description="INT XBAR 10 Input Select.">
		<bitfield id="INTXBAR10_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR10_G1" acronym="CONTROLSS_INTXBAR10_G1" offset="900" width="32" description="INT XBAR 10 Input Select.">
		<bitfield id="INTXBAR10_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR10_G2" acronym="CONTROLSS_INTXBAR10_G2" offset="904" width="32" description="INT XBAR 10 Input Select.">
		<bitfield id="INTXBAR10_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR10_G3" acronym="CONTROLSS_INTXBAR10_G3" offset="908" width="32" description="INT XBAR 10 Input Select.">
		<bitfield id="INTXBAR10_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR10_G4" acronym="CONTROLSS_INTXBAR10_G4" offset="912" width="32" description="INT XBAR 10 Input Select.">
		<bitfield id="INTXBAR10_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR10_G5" acronym="CONTROLSS_INTXBAR10_G5" offset="916" width="32" description="INT XBAR 10 Input Select.">
		<bitfield id="INTXBAR10_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR10_G6" acronym="CONTROLSS_INTXBAR10_G6" offset="920" width="32" description="INT XBAR 10 Input Select.">
		<bitfield id="INTXBAR10_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR11_G0" acronym="CONTROLSS_INTXBAR11_G0" offset="960" width="32" description="INT XBAR 11 Input Select.">
		<bitfield id="INTXBAR11_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR11_G1" acronym="CONTROLSS_INTXBAR11_G1" offset="964" width="32" description="INT XBAR 11 Input Select.">
		<bitfield id="INTXBAR11_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR11_G2" acronym="CONTROLSS_INTXBAR11_G2" offset="968" width="32" description="INT XBAR 11 Input Select.">
		<bitfield id="INTXBAR11_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR11_G3" acronym="CONTROLSS_INTXBAR11_G3" offset="972" width="32" description="INT XBAR 11 Input Select.">
		<bitfield id="INTXBAR11_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR11_G4" acronym="CONTROLSS_INTXBAR11_G4" offset="976" width="32" description="INT XBAR 11 Input Select.">
		<bitfield id="INTXBAR11_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR11_G5" acronym="CONTROLSS_INTXBAR11_G5" offset="980" width="32" description="INT XBAR 11 Input Select.">
		<bitfield id="INTXBAR11_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR11_G6" acronym="CONTROLSS_INTXBAR11_G6" offset="984" width="32" description="INT XBAR 11 Input Select.">
		<bitfield id="INTXBAR11_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR12_G0" acronym="CONTROLSS_INTXBAR12_G0" offset="1024" width="32" description="INT XBAR 12 Input Select.">
		<bitfield id="INTXBAR12_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR12_G1" acronym="CONTROLSS_INTXBAR12_G1" offset="1028" width="32" description="INT XBAR 12 Input Select.">
		<bitfield id="INTXBAR12_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR12_G2" acronym="CONTROLSS_INTXBAR12_G2" offset="1032" width="32" description="INT XBAR 12 Input Select.">
		<bitfield id="INTXBAR12_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR12_G3" acronym="CONTROLSS_INTXBAR12_G3" offset="1036" width="32" description="INT XBAR 12 Input Select.">
		<bitfield id="INTXBAR12_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR12_G4" acronym="CONTROLSS_INTXBAR12_G4" offset="1040" width="32" description="INT XBAR 12 Input Select.">
		<bitfield id="INTXBAR12_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR12_G5" acronym="CONTROLSS_INTXBAR12_G5" offset="1044" width="32" description="INT XBAR 12 Input Select.">
		<bitfield id="INTXBAR12_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR12_G6" acronym="CONTROLSS_INTXBAR12_G6" offset="1048" width="32" description="INT XBAR 12 Input Select.">
		<bitfield id="INTXBAR12_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR13_G0" acronym="CONTROLSS_INTXBAR13_G0" offset="1088" width="32" description="INT XBAR 13 Input Select.">
		<bitfield id="INTXBAR13_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR13_G1" acronym="CONTROLSS_INTXBAR13_G1" offset="1092" width="32" description="INT XBAR 13 Input Select.">
		<bitfield id="INTXBAR13_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR13_G2" acronym="CONTROLSS_INTXBAR13_G2" offset="1096" width="32" description="INT XBAR 13 Input Select.">
		<bitfield id="INTXBAR13_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR13_G3" acronym="CONTROLSS_INTXBAR13_G3" offset="1100" width="32" description="INT XBAR 13 Input Select.">
		<bitfield id="INTXBAR13_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR13_G4" acronym="CONTROLSS_INTXBAR13_G4" offset="1104" width="32" description="INT XBAR 13 Input Select.">
		<bitfield id="INTXBAR13_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR13_G5" acronym="CONTROLSS_INTXBAR13_G5" offset="1108" width="32" description="INT XBAR 13 Input Select.">
		<bitfield id="INTXBAR13_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR13_G6" acronym="CONTROLSS_INTXBAR13_G6" offset="1112" width="32" description="INT XBAR 13 Input Select.">
		<bitfield id="INTXBAR13_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR14_G0" acronym="CONTROLSS_INTXBAR14_G0" offset="1152" width="32" description="INT XBAR 14 Input Select.">
		<bitfield id="INTXBAR14_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR14_G1" acronym="CONTROLSS_INTXBAR14_G1" offset="1156" width="32" description="INT XBAR 14 Input Select.">
		<bitfield id="INTXBAR14_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR14_G2" acronym="CONTROLSS_INTXBAR14_G2" offset="1160" width="32" description="INT XBAR 14 Input Select.">
		<bitfield id="INTXBAR14_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR14_G3" acronym="CONTROLSS_INTXBAR14_G3" offset="1164" width="32" description="INT XBAR 14 Input Select.">
		<bitfield id="INTXBAR14_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR14_G4" acronym="CONTROLSS_INTXBAR14_G4" offset="1168" width="32" description="INT XBAR 14 Input Select.">
		<bitfield id="INTXBAR14_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR14_G5" acronym="CONTROLSS_INTXBAR14_G5" offset="1172" width="32" description="INT XBAR 14 Input Select.">
		<bitfield id="INTXBAR14_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR14_G6" acronym="CONTROLSS_INTXBAR14_G6" offset="1176" width="32" description="INT XBAR 14 Input Select.">
		<bitfield id="INTXBAR14_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR15_G0" acronym="CONTROLSS_INTXBAR15_G0" offset="1216" width="32" description="INT XBAR 15 Input Select.">
		<bitfield id="INTXBAR15_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR15_G1" acronym="CONTROLSS_INTXBAR15_G1" offset="1220" width="32" description="INT XBAR 15 Input Select.">
		<bitfield id="INTXBAR15_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR15_G2" acronym="CONTROLSS_INTXBAR15_G2" offset="1224" width="32" description="INT XBAR 15 Input Select.">
		<bitfield id="INTXBAR15_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR15_G3" acronym="CONTROLSS_INTXBAR15_G3" offset="1228" width="32" description="INT XBAR 15 Input Select.">
