ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CONTROLSS_INTXBAR_CONTROLSS_502D5000h.xml
		<bitfield id="INTXBAR15_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR15_G4" acronym="CONTROLSS_INTXBAR15_G4" offset="1232" width="32" description="INT XBAR 15 Input Select.">
		<bitfield id="INTXBAR15_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR15_G5" acronym="CONTROLSS_INTXBAR15_G5" offset="1236" width="32" description="INT XBAR 15 Input Select.">
		<bitfield id="INTXBAR15_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR15_G6" acronym="CONTROLSS_INTXBAR15_G6" offset="1240" width="32" description="INT XBAR 15 Input Select.">
		<bitfield id="INTXBAR15_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR16_G0" acronym="CONTROLSS_INTXBAR16_G0" offset="1280" width="32" description="INT XBAR 16 Input Select.">
		<bitfield id="INTXBAR16_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR16_G1" acronym="CONTROLSS_INTXBAR16_G1" offset="1284" width="32" description="INT XBAR 16 Input Select.">
		<bitfield id="INTXBAR16_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR16_G2" acronym="CONTROLSS_INTXBAR16_G2" offset="1288" width="32" description="INT XBAR 16 Input Select.">
		<bitfield id="INTXBAR16_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR16_G3" acronym="CONTROLSS_INTXBAR16_G3" offset="1292" width="32" description="INT XBAR 16 Input Select.">
		<bitfield id="INTXBAR16_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR16_G4" acronym="CONTROLSS_INTXBAR16_G4" offset="1296" width="32" description="INT XBAR 16 Input Select.">
		<bitfield id="INTXBAR16_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR16_G5" acronym="CONTROLSS_INTXBAR16_G5" offset="1300" width="32" description="INT XBAR 16 Input Select.">
		<bitfield id="INTXBAR16_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR16_G6" acronym="CONTROLSS_INTXBAR16_G6" offset="1304" width="32" description="INT XBAR 16 Input Select.">
		<bitfield id="INTXBAR16_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR17_G0" acronym="CONTROLSS_INTXBAR17_G0" offset="1344" width="32" description="INT XBAR 17 Input Select.">
		<bitfield id="INTXBAR17_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR17_G1" acronym="CONTROLSS_INTXBAR17_G1" offset="1348" width="32" description="INT XBAR 17 Input Select.">
		<bitfield id="INTXBAR17_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR17_G2" acronym="CONTROLSS_INTXBAR17_G2" offset="1352" width="32" description="INT XBAR 17 Input Select.">
		<bitfield id="INTXBAR17_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR17_G3" acronym="CONTROLSS_INTXBAR17_G3" offset="1356" width="32" description="INT XBAR 17 Input Select.">
		<bitfield id="INTXBAR17_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR17_G4" acronym="CONTROLSS_INTXBAR17_G4" offset="1360" width="32" description="INT XBAR 17 Input Select.">
		<bitfield id="INTXBAR17_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR17_G5" acronym="CONTROLSS_INTXBAR17_G5" offset="1364" width="32" description="INT XBAR 17 Input Select.">
		<bitfield id="INTXBAR17_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR17_G6" acronym="CONTROLSS_INTXBAR17_G6" offset="1368" width="32" description="INT XBAR 17 Input Select.">
		<bitfield id="INTXBAR17_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR18_G0" acronym="CONTROLSS_INTXBAR18_G0" offset="1408" width="32" description="INT XBAR 18 Input Select.">
		<bitfield id="INTXBAR18_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR18_G1" acronym="CONTROLSS_INTXBAR18_G1" offset="1412" width="32" description="INT XBAR 18 Input Select.">
		<bitfield id="INTXBAR18_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR18_G2" acronym="CONTROLSS_INTXBAR18_G2" offset="1416" width="32" description="INT XBAR 18 Input Select.">
		<bitfield id="INTXBAR18_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR18_G3" acronym="CONTROLSS_INTXBAR18_G3" offset="1420" width="32" description="INT XBAR 18 Input Select.">
		<bitfield id="INTXBAR18_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR18_G4" acronym="CONTROLSS_INTXBAR18_G4" offset="1424" width="32" description="INT XBAR 18 Input Select.">
		<bitfield id="INTXBAR18_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR18_G5" acronym="CONTROLSS_INTXBAR18_G5" offset="1428" width="32" description="INT XBAR 18 Input Select.">
		<bitfield id="INTXBAR18_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR18_G6" acronym="CONTROLSS_INTXBAR18_G6" offset="1432" width="32" description="INT XBAR 18 Input Select.">
		<bitfield id="INTXBAR18_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR19_G0" acronym="CONTROLSS_INTXBAR19_G0" offset="1472" width="32" description="INT XBAR 19 Input Select.">
		<bitfield id="INTXBAR19_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR19_G1" acronym="CONTROLSS_INTXBAR19_G1" offset="1476" width="32" description="INT XBAR 19 Input Select.">
		<bitfield id="INTXBAR19_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR19_G2" acronym="CONTROLSS_INTXBAR19_G2" offset="1480" width="32" description="INT XBAR 19 Input Select.">
		<bitfield id="INTXBAR19_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR19_G3" acronym="CONTROLSS_INTXBAR19_G3" offset="1484" width="32" description="INT XBAR 19 Input Select.">
		<bitfield id="INTXBAR19_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR19_G4" acronym="CONTROLSS_INTXBAR19_G4" offset="1488" width="32" description="INT XBAR 19 Input Select.">
		<bitfield id="INTXBAR19_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR19_G5" acronym="CONTROLSS_INTXBAR19_G5" offset="1492" width="32" description="INT XBAR 19 Input Select.">
		<bitfield id="INTXBAR19_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR19_G6" acronym="CONTROLSS_INTXBAR19_G6" offset="1496" width="32" description="INT XBAR 19 Input Select.">
		<bitfield id="INTXBAR19_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR20_G0" acronym="CONTROLSS_INTXBAR20_G0" offset="1536" width="32" description="INT XBAR 20 Input Select.">
		<bitfield id="INTXBAR20_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR20_G1" acronym="CONTROLSS_INTXBAR20_G1" offset="1540" width="32" description="INT XBAR 20 Input Select.">
		<bitfield id="INTXBAR20_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR20_G2" acronym="CONTROLSS_INTXBAR20_G2" offset="1544" width="32" description="INT XBAR 20 Input Select.">
		<bitfield id="INTXBAR20_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR20_G3" acronym="CONTROLSS_INTXBAR20_G3" offset="1548" width="32" description="INT XBAR 20 Input Select.">
		<bitfield id="INTXBAR20_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR20_G4" acronym="CONTROLSS_INTXBAR20_G4" offset="1552" width="32" description="INT XBAR 20 Input Select.">
		<bitfield id="INTXBAR20_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR20_G5" acronym="CONTROLSS_INTXBAR20_G5" offset="1556" width="32" description="INT XBAR 20 Input Select.">
		<bitfield id="INTXBAR20_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR20_G6" acronym="CONTROLSS_INTXBAR20_G6" offset="1560" width="32" description="INT XBAR 20 Input Select.">
		<bitfield id="INTXBAR20_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR21_G0" acronym="CONTROLSS_INTXBAR21_G0" offset="1600" width="32" description="INT XBAR 21 Input Select.">
		<bitfield id="INTXBAR21_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR21_G1" acronym="CONTROLSS_INTXBAR21_G1" offset="1604" width="32" description="INT XBAR 21 Input Select.">
		<bitfield id="INTXBAR21_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR21_G2" acronym="CONTROLSS_INTXBAR21_G2" offset="1608" width="32" description="INT XBAR 21 Input Select.">
		<bitfield id="INTXBAR21_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR21_G3" acronym="CONTROLSS_INTXBAR21_G3" offset="1612" width="32" description="INT XBAR 21 Input Select.">
		<bitfield id="INTXBAR21_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR21_G4" acronym="CONTROLSS_INTXBAR21_G4" offset="1616" width="32" description="INT XBAR 21 Input Select.">
		<bitfield id="INTXBAR21_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR21_G5" acronym="CONTROLSS_INTXBAR21_G5" offset="1620" width="32" description="INT XBAR 21 Input Select.">
		<bitfield id="INTXBAR21_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR21_G6" acronym="CONTROLSS_INTXBAR21_G6" offset="1624" width="32" description="INT XBAR 21 Input Select.">
		<bitfield id="INTXBAR21_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR22_G0" acronym="CONTROLSS_INTXBAR22_G0" offset="1664" width="32" description="INT XBAR 22 Input Select.">
		<bitfield id="INTXBAR22_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR22_G1" acronym="CONTROLSS_INTXBAR22_G1" offset="1668" width="32" description="INT XBAR 22 Input Select.">
		<bitfield id="INTXBAR22_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR22_G2" acronym="CONTROLSS_INTXBAR22_G2" offset="1672" width="32" description="INT XBAR 22 Input Select.">
		<bitfield id="INTXBAR22_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR22_G3" acronym="CONTROLSS_INTXBAR22_G3" offset="1676" width="32" description="INT XBAR 22 Input Select.">
		<bitfield id="INTXBAR22_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR22_G4" acronym="CONTROLSS_INTXBAR22_G4" offset="1680" width="32" description="INT XBAR 22 Input Select.">
		<bitfield id="INTXBAR22_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR22_G5" acronym="CONTROLSS_INTXBAR22_G5" offset="1684" width="32" description="INT XBAR 22 Input Select.">
		<bitfield id="INTXBAR22_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR22_G6" acronym="CONTROLSS_INTXBAR22_G6" offset="1688" width="32" description="INT XBAR 22 Input Select.">
		<bitfield id="INTXBAR22_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR23_G0" acronym="CONTROLSS_INTXBAR23_G0" offset="1728" width="32" description="INT XBAR 23 Input Select.">
		<bitfield id="INTXBAR23_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR23_G1" acronym="CONTROLSS_INTXBAR23_G1" offset="1732" width="32" description="INT XBAR 23 Input Select.">
