ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CONTROLSS_INTXBAR_CONTROLSS_502D5000h.xml
		<bitfield id="INTXBAR23_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR23_G2" acronym="CONTROLSS_INTXBAR23_G2" offset="1736" width="32" description="INT XBAR 23 Input Select.">
		<bitfield id="INTXBAR23_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR23_G3" acronym="CONTROLSS_INTXBAR23_G3" offset="1740" width="32" description="INT XBAR 23 Input Select.">
		<bitfield id="INTXBAR23_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR23_G4" acronym="CONTROLSS_INTXBAR23_G4" offset="1744" width="32" description="INT XBAR 23 Input Select.">
		<bitfield id="INTXBAR23_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR23_G5" acronym="CONTROLSS_INTXBAR23_G5" offset="1748" width="32" description="INT XBAR 23 Input Select.">
		<bitfield id="INTXBAR23_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR23_G6" acronym="CONTROLSS_INTXBAR23_G6" offset="1752" width="32" description="INT XBAR 23 Input Select.">
		<bitfield id="INTXBAR23_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR24_G0" acronym="CONTROLSS_INTXBAR24_G0" offset="1792" width="32" description="INT XBAR 24 Input Select.">
		<bitfield id="INTXBAR24_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR24_G1" acronym="CONTROLSS_INTXBAR24_G1" offset="1796" width="32" description="INT XBAR 24 Input Select.">
		<bitfield id="INTXBAR24_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR24_G2" acronym="CONTROLSS_INTXBAR24_G2" offset="1800" width="32" description="INT XBAR 24 Input Select.">
		<bitfield id="INTXBAR24_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR24_G3" acronym="CONTROLSS_INTXBAR24_G3" offset="1804" width="32" description="INT XBAR 24 Input Select.">
		<bitfield id="INTXBAR24_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR24_G4" acronym="CONTROLSS_INTXBAR24_G4" offset="1808" width="32" description="INT XBAR 24 Input Select.">
		<bitfield id="INTXBAR24_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR24_G5" acronym="CONTROLSS_INTXBAR24_G5" offset="1812" width="32" description="INT XBAR 24 Input Select.">
		<bitfield id="INTXBAR24_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR24_G6" acronym="CONTROLSS_INTXBAR24_G6" offset="1816" width="32" description="INT XBAR 24 Input Select.">
		<bitfield id="INTXBAR24_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR25_G0" acronym="CONTROLSS_INTXBAR25_G0" offset="1856" width="32" description="INT XBAR 25 Input Select.">
		<bitfield id="INTXBAR25_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR25_G1" acronym="CONTROLSS_INTXBAR25_G1" offset="1860" width="32" description="INT XBAR 25 Input Select.">
		<bitfield id="INTXBAR25_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR25_G2" acronym="CONTROLSS_INTXBAR25_G2" offset="1864" width="32" description="INT XBAR 25 Input Select.">
		<bitfield id="INTXBAR25_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR25_G3" acronym="CONTROLSS_INTXBAR25_G3" offset="1868" width="32" description="INT XBAR 25 Input Select.">
		<bitfield id="INTXBAR25_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR25_G4" acronym="CONTROLSS_INTXBAR25_G4" offset="1872" width="32" description="INT XBAR 25 Input Select.">
		<bitfield id="INTXBAR25_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR25_G5" acronym="CONTROLSS_INTXBAR25_G5" offset="1876" width="32" description="INT XBAR 25 Input Select.">
		<bitfield id="INTXBAR25_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR25_G6" acronym="CONTROLSS_INTXBAR25_G6" offset="1880" width="32" description="INT XBAR 25 Input Select.">
		<bitfield id="INTXBAR25_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR26_G0" acronym="CONTROLSS_INTXBAR26_G0" offset="1920" width="32" description="INT XBAR 26 Input Select.">
		<bitfield id="INTXBAR26_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR26_G1" acronym="CONTROLSS_INTXBAR26_G1" offset="1924" width="32" description="INT XBAR 26 Input Select.">
		<bitfield id="INTXBAR26_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR26_G2" acronym="CONTROLSS_INTXBAR26_G2" offset="1928" width="32" description="INT XBAR 26 Input Select.">
		<bitfield id="INTXBAR26_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR26_G3" acronym="CONTROLSS_INTXBAR26_G3" offset="1932" width="32" description="INT XBAR 26 Input Select.">
		<bitfield id="INTXBAR26_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR26_G4" acronym="CONTROLSS_INTXBAR26_G4" offset="1936" width="32" description="INT XBAR 26 Input Select.">
		<bitfield id="INTXBAR26_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR26_G5" acronym="CONTROLSS_INTXBAR26_G5" offset="1940" width="32" description="INT XBAR 26 Input Select.">
		<bitfield id="INTXBAR26_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR26_G6" acronym="CONTROLSS_INTXBAR26_G6" offset="1944" width="32" description="INT XBAR 26 Input Select.">
		<bitfield id="INTXBAR26_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR27_G0" acronym="CONTROLSS_INTXBAR27_G0" offset="1984" width="32" description="INT XBAR 27 Input Select.">
		<bitfield id="INTXBAR27_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR27_G1" acronym="CONTROLSS_INTXBAR27_G1" offset="1988" width="32" description="INT XBAR 27 Input Select.">
		<bitfield id="INTXBAR27_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR27_G2" acronym="CONTROLSS_INTXBAR27_G2" offset="1992" width="32" description="INT XBAR 27 Input Select.">
		<bitfield id="INTXBAR27_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR27_G3" acronym="CONTROLSS_INTXBAR27_G3" offset="1996" width="32" description="INT XBAR 27 Input Select.">
		<bitfield id="INTXBAR27_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR27_G4" acronym="CONTROLSS_INTXBAR27_G4" offset="2000" width="32" description="INT XBAR 27 Input Select.">
		<bitfield id="INTXBAR27_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR27_G5" acronym="CONTROLSS_INTXBAR27_G5" offset="2004" width="32" description="INT XBAR 27 Input Select.">
		<bitfield id="INTXBAR27_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR27_G6" acronym="CONTROLSS_INTXBAR27_G6" offset="2008" width="32" description="INT XBAR 27 Input Select.">
		<bitfield id="INTXBAR27_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR28_G0" acronym="CONTROLSS_INTXBAR28_G0" offset="2048" width="32" description="INT XBAR 28 Input Select.">
		<bitfield id="INTXBAR28_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR28_G1" acronym="CONTROLSS_INTXBAR28_G1" offset="2052" width="32" description="INT XBAR 28 Input Select.">
		<bitfield id="INTXBAR28_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR28_G2" acronym="CONTROLSS_INTXBAR28_G2" offset="2056" width="32" description="INT XBAR 28 Input Select.">
		<bitfield id="INTXBAR28_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR28_G3" acronym="CONTROLSS_INTXBAR28_G3" offset="2060" width="32" description="INT XBAR 28 Input Select.">
		<bitfield id="INTXBAR28_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR28_G4" acronym="CONTROLSS_INTXBAR28_G4" offset="2064" width="32" description="INT XBAR 28 Input Select.">
		<bitfield id="INTXBAR28_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR28_G5" acronym="CONTROLSS_INTXBAR28_G5" offset="2068" width="32" description="INT XBAR 28 Input Select.">
		<bitfield id="INTXBAR28_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR28_G6" acronym="CONTROLSS_INTXBAR28_G6" offset="2072" width="32" description="INT XBAR 28 Input Select.">
		<bitfield id="INTXBAR28_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR29_G0" acronym="CONTROLSS_INTXBAR29_G0" offset="2112" width="32" description="INT XBAR 29 Input Select.">
		<bitfield id="INTXBAR29_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR29_G1" acronym="CONTROLSS_INTXBAR29_G1" offset="2116" width="32" description="INT XBAR 29 Input Select.">
		<bitfield id="INTXBAR29_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR29_G2" acronym="CONTROLSS_INTXBAR29_G2" offset="2120" width="32" description="INT XBAR 29 Input Select.">
		<bitfield id="INTXBAR29_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR29_G3" acronym="CONTROLSS_INTXBAR29_G3" offset="2124" width="32" description="INT XBAR 29 Input Select.">
		<bitfield id="INTXBAR29_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR29_G4" acronym="CONTROLSS_INTXBAR29_G4" offset="2128" width="32" description="INT XBAR 29 Input Select.">
		<bitfield id="INTXBAR29_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR29_G5" acronym="CONTROLSS_INTXBAR29_G5" offset="2132" width="32" description="INT XBAR 29 Input Select.">
		<bitfield id="INTXBAR29_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR29_G6" acronym="CONTROLSS_INTXBAR29_G6" offset="2136" width="32" description="INT XBAR 29 Input Select.">
		<bitfield id="INTXBAR29_G6_SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBAR G6 Input Select0:EQEP0.INT1:EQEP1.INT2:EQEP2.INT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR30_G0" acronym="CONTROLSS_INTXBAR30_G0" offset="2176" width="32" description="INT XBAR 30 Input Select.">
		<bitfield id="INTXBAR30_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM INT interrupt to corresponding XBAR1:PWMx.INT is selected0:PWMx.INT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR30_G1" acronym="CONTROLSS_INTXBAR30_G1" offset="2180" width="32" description="INT XBAR 30 Input Select.">
		<bitfield id="INTXBAR30_G1_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM TZINT interrupt to corresponding XBAR1:PWMx.TZINT is selected0:PWMx.TZINT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR30_G2" acronym="CONTROLSS_INTXBAR30_G2" offset="2184" width="32" description="INT XBAR 30 Input Select.">
		<bitfield id="INTXBAR30_G2_SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBAR G2 Input Select0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="24:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR30_G3" acronym="CONTROLSS_INTXBAR30_G3" offset="2188" width="32" description="INT XBAR 30 Input Select.">
		<bitfield id="INTXBAR30_G3_SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBAR G3 Input Select0:FSIRX0.INT1N1:FSIRX0.INT2N2:FSIRX1.INT1N3:FSIRX1.INT2N4:FSIRX2.INT1N5:FSIRX2.INT2N6:FSIRX3.INT1N7:FSIRX3.INT2N8:FSITX0.INT1N9:FSITX0.INT2N10:FSITX1.INT1N11:FSITX1.INT2N12:FSITX2.INT1N13:FSITX2.INT2N14:FSITX3.INT1N15:FSITX3.INT2N" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR30_G4" acronym="CONTROLSS_INTXBAR30_G4" offset="2192" width="32" description="INT XBAR 30 Input Select.">
		<bitfield id="INTXBAR30_G4_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G4 Input Select0:SD0.ERR1:SD0.FILT1.DRINT2:SD0.FILT2.DRINT3:SD0.FILT3.DRINT4:SD0.FILT4.DRINT5:SD1.ERR6:SD1.FILT1.DRINT7:SD1.FILT2.DRINT8:SD1.FILT3.DRINT9:SD1.FILT4.DRINT" range="9:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_INTXBAR30_G5" acronym="CONTROLSS_INTXBAR30_G5" offset="2196" width="32" description="INT XBAR 30 Input Select.">
		<bitfield id="INTXBAR30_G5_SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBAR G5 Input Select0:ECAP0.INT1:ECAP1.INT2:ECAP2.INT3:ECAP3.INT4:ECAP4.INT5:ECAP5.INT6:ECAP6.INT7:ECAP7.INT8:ECAP8.INT9:ECAP9.INT" range="9:0" rwaccess="R/W"/>
